<?php

1. 计算机诞生之后
2. 计算机之间如何通信 局域网->阿帕网- >0SI

    OS1: 1.物理层(统一的标准，协议)
         2.数据链路层(数据流转的过程， 统-的标准,协议)
         3.网络层 寻址 baidu.com->39.156.69.79,如何找到这个地址的网络通信
         4.传输层 传输数据 A-B
         5.会话层 haidu. com
         6.表示层 用来表示数据的统一处理
         7.应用层  .......真正应用你的内容

    http/https
    tcp/ip协议
         1.网络接口层
            1.物理层(统一的标准，协议)
            2.数据链路层(数据流转的过程， 统-的标准,协议)
         2.网络IP层
            网络层 寻址 baidu.com->39.156.69.79,如何找到这个地址的网络通信
         3.传输层
            传输数据 A-B
         4.应用层
            5.会话层 haidu. com
            6.表示层 用来表示数据的统一处理
            7.应用层  .......真正应用你的内容

        
        应用层的协议：
        FTP协议  文件控制、文件传输
        SMTP  邮件协议
        UPD  直播，udp协议
        http  基于客户/服务器模式，且面向连接的一种协议

        


?>